degenia_wsdl.xml

<?xml version="1.0" encoding="UTF-8"?><wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:soapbind="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:bipro="http://www.bipro.net/namespace" xmlns:nac="http://www.bipro.net/namespace/nachrichten" xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:tran="http://www.bipro.net/namespace/transfer" targetNamespace="http://www.bipro.net/namespace"> <wsdl:types> <xsd:schema version="1.0" attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://www.bipro.net/namespace"> <xsd:import namespace="http://www.bipro.net/namespace/nachrichten" schemaLocation="http://127.0.0.1:8080/X4/httpstarter/ReST/BiPRO/schema/2.6.1/bipro-nachrichten-2.6.1.xsd"/> <xsd:import namespace="http://www.bipro.net/namespace/allgemein" schemaLocation="http://127.0.0.1:8080/X4/httpstarter/ReST/BiPRO/schema/2.6.1/bipro-allgemein-2.6.1.xsd"/> <xsd:import namespace="http://www.bipro.net/namespace/transfer" schemaLocation="http://127.0.0.1:8080/X4/httpstarter/ReST/BiPRO/schema/2.6.1/bipro-transfer-2.6.1.xsd"/> <xsd:import namespace="http://www.bipro.net/namespace/transfer/gevo" schemaLocation="http://127.0.0.1:8080/X4/httpstarter/ReST/BiPRO/schema/2.6.1/bipro-transfer-gevo-2.6.1.xsd"/> <xsd:import namespace="http://www.bipro.net/namespace/transfer/inkassostoerfall" schemaLocation="http://127.0.0.1:8080/X4/httpstarter/ReST/BiPRO/schema/2.6.1/bipro-transfer-inkassostoerfall-2.6.1.xsd"/> <xsd:import namespace="http://www.bipro.net/namespace/transfer/vertrag" schemaLocation="http://127.0.0.1:8080/X4/httpstarter/ReST/BiPRO/schema/2.6.1/bipro-transfer-vertrag-2.6.1.xsd"/> <xsd:import namespace="http://www.bipro.net/namespace/transfer/schaden-leistung" schemaLocation="http://127.0.0.1:8080/X4/httpstarter/ReST/BiPRO/schema/2.6.1/bipro-transfer-schaden-leistung-2.6.1.xsd"/> <xsd:import namespace="http://www.bipro.net/namespace/transfer/sepa" schemaLocation="http://127.0.0.1:8080/X4/httpstarter/ReST/BiPRO/schema/2.6.1/bipro-transfer-sepa-2.6.1.xsd"/> </xsd:schema> </wsdl:types> <wsdl:message name="listShipmentsRequest"> <wsdl:part name="parameters" element="tran:listShipments"/> </wsdl:message> <wsdl:message name="listShipmentsResponse"> <wsdl:part name="parameters" element="tran:listShipmentsResponse"/> </wsdl:message> <wsdl:message name="listShipmentsFault"> <wsdl:part name="parameters" element="nac:BiproException"/> </wsdl:message> <wsdl:message name="getShipmentRequest"> <wsdl:part name="parameters" element="tran:getShipment"/> </wsdl:message> <wsdl:message name="getShipmentResponse"> <wsdl:part name="parameters" element="tran:getShipmentResponse"/> </wsdl:message> <wsdl:message name="getShipmentFault"> <wsdl:part name="parameters" element="nac:BiproException"/> </wsdl:message> <wsdl:message name="acknowledgeShipmentRequest"> <wsdl:part name="parameters" element="tran:acknowledgeShipment"/> </wsdl:message> <wsdl:message name="acknowledgeShipmentResponse"> <wsdl:part name="parameters" element="tran:acknowledgeShipmentResponse"/> </wsdl:message> <wsdl:message name="acknowledgeShipmentFault"> <wsdl:part name="parameters" element="nac:BiproException"/> </wsdl:message> <wsdl:message name="setShipmentRequest"> <wsdl:part name="parameters" element="tran:setShipment"/> </wsdl:message> <wsdl:message name="setShipmentResponse"> <wsdl:part name="parameters" element="tran:setShipmentResponse"/> </wsdl:message> <wsdl:message name="setShipmentFault"> <wsdl:part name="parameters" element="nac:BiproException"/> </wsdl:message> <wsdl:portType name="ServicePortType"> <wsdl:operation name="listShipments" parameterOrder="parameters"> <wsdl:input message="bipro:listShipmentsRequest" name="listShipmentsRequest"/> <wsdl:output message="bipro:listShipmentsResponse" name="listShipmentsResponse"/> <wsdl:fault message="bipro:listShipmentsFault" name="listShipmentsFault"/> </wsdl:operation> <wsdl:operation name="getShipment" parameterOrder="parameters"> <wsdl:input message="bipro:getShipmentRequest" name="getShipmentRequest"/> <wsdl:output message="bipro:getShipmentResponse" name="getShipmentResponse"/> <wsdl:fault message="bipro:getShipmentFault" name="getShipmentFault"/> </wsdl:operation> <wsdl:operation name="acknowledgeShipment" parameterOrder="parameters"> <wsdl:input message="bipro:acknowledgeShipmentRequest" name="acknowledgeShipmentRequest"/> <wsdl:output message="bipro:acknowledgeShipmentResponse" name="acknowledgeShipmentResponse"/> <wsdl:fault message="bipro:acknowledgeShipmentFault" name="acknowledgeShipmentFault"/> </wsdl:operation> <wsdl:operation name="setShipment" parameterOrder="parameters"> <wsdl:input message="bipro:setShipmentRequest" name="setShipmentRequest"/> <wsdl:output message="bipro:setShipmentResponse" name="setShipmentResponse"/> <wsdl:fault message="bipro:setShipmentFault" name="setShipmentFault"/> </wsdl:operation> </wsdl:portType> <wsdl:binding name="ServiceBinding" type="bipro:ServicePortType"> <soapbind:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/> <wsdl:operation name="listShipments"> <soapbind:operation style="document" soapAction="urn:listShipments"/> <wsdl:input name="listShipmentsRequest"> <soapbind:body use="literal"/> </wsdl:input> <wsdl:output name="listShipmentsResponse"> <soapbind:body use="literal"/> </wsdl:output> </wsdl:operation> <wsdl:operation name="getShipment"> <soapbind:operation style="document" soapAction="urn:getShipment"/> <wsdl:input name="getShipmentRequest"> <soapbind:body use="literal"/> </wsdl:input> <wsdl:output name="getShipmentResponse"> <soapbind:body use="literal"/> </wsdl:output> </wsdl:operation> <wsdl:operation name="acknowledgeShipment"> <soapbind:operation style="document" soapAction="urn:acknowledgeShipment"/> <wsdl:input name="acknowledgeShipmentRequest"> <soapbind:body use="literal"/> </wsdl:input> <wsdl:output name="acknowledgeShipmentResponse"> <soapbind:body use="literal"/> </wsdl:output> </wsdl:operation> <wsdl:operation name="setShipment"> <soapbind:operation style="document" soapAction="urn:setShipment"/> <wsdl:input name="setShipmentRequest"> <soapbind:body use="literal"/> </wsdl:input> <wsdl:output name="setShipmentResponse"> <soapbind:body use="literal"/> </wsdl:output> </wsdl:operation> </wsdl:binding> <wsdl:service name="Service"> <wsdl:port name="ServicePort" binding="bipro:ServiceBinding"> <soapbind:address location="http://127.0.0.1:8080/X4/httpstarter/ReST/BiPRO/430_Transfer/Service_2.6.1.1.0"/> </wsdl:port> </wsdl:service></wsdl:definitions>