app/src/main/assets/soap/request_bipro430-get.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tran="http://www.bipro.net/namespace/transfer" xmlns:bas="http://www.bipro.net/namespace/basis" xmlns:nac="http://www.bipro.net/namespace/nachrichten">
    ${soapHeader}
    <soapenv:Body>
        <tran:getShipment>
                <tran:Request>
                    <nac:BiPROVersion>${version}</nac:BiPROVersion>
                    <nac:ConsumerID>Android BiPRO Client</nac:ConsumerID>
                    <tran:ID>${id}</tran:ID>
                </tran:Request>
        </tran:getShipment>
    </soapenv:Body>
</soapenv:Envelope>