test/xml/list_request.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tran="http://www.bipro.net/namespace/transfer" xmlns:all="http://www.bipro.net/namespace/allgemein">
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsc:SecurityContextToken xmlns:wsc="http://schemas.xmlsoap.org/ws/2005/02/sc">
                <wsc:Identifier>bipro:X509Token.qGDzkHwagPp4tqXx9axwyQNxnqbxwA</wsc:Identifier>
            </wsc:SecurityContextToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <tran:listShipments>
            <tran:Request>
                <all:BiPROVersion>2.1.1.1.0</all:BiPROVersion>
                <tran:BestaetigeLieferungen>true</tran:BestaetigeLieferungen>
            </tran:Request>
        </tran:listShipments>
    </soapenv:Body>
</soapenv:Envelope>